package by.jb.mod1.main;

// Напишите программу вычисления суммы четырёх слагаемых.

public class Task5 {

	public static void main(String[] args) {
		double a = 5;
		double b = 7; 
		double c = 9.56;
		double d = 95.2;
		double sum;
		
		sum = a + b + c + d;
		
		System.out.print("Сумма = " + sum);
	}

}
